src/InformationRegisters/DR_НастройкиАдаптера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>DR_НастройкиАдаптера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Промпт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ApiKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипАдаптера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/DR_Settings/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// 
// Copyright (C) 2026 Yezhi-NI
// SPDX-License-Identifier: AGPL-3.0-only
// Project: https://github.com/Yezhi-NI/DoRIS
// Contact: https://t.me/afterdev 
//
////////////////////////////////////////////////////////////////////////////////
//
// DoRIS(Дорис)
//
// Общий модуль: DR_Settings
//
// Назначение:
//     Создание и изменение настроек библиотеки.
//
// Экспортный интерфейс:
//
//     ПолучитьНастройки()
//     УстановитьНастройку()
//
////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьНастройки() Экспорт
	
	Провайдер = Константы.DR_АктивныйАдаптер.Получить();
	
	СохраненныеНастройки = ПрочитатьНастройки(Провайдер); 
	
	Провайдер = ПолучитьПровайдерРаспознавания(Провайдер);
		
	Если Провайдер = Неопределено Тогда
		DR_Validation.ВызватьИсключениеОшибки("Не удалось определить адаптер для распознавания");	
	КонецЕсли;

    Настройки = Новый Структура;
	
	// OCR
    Настройки.Вставить("ПровайдерOCR", Провайдер);
    Настройки.Вставить("Сервер", СохраненныеНастройки.АдресСервиса);
	Настройки.Вставить("АдресСервиса", СохраненныеНастройки.АдресРесурса);
    Настройки.Вставить("ApiKey", СохраненныеНастройки.ApiKey);
    Настройки.Вставить("Промпт", СохраненныеНастройки.Промпт);
    // Таймауты
    Настройки.Вставить("ТаймаутHTTP", СохраненныеНастройки.Таймаут);
    Настройки.Вставить("ИнтервалОпроса", 2);
    Настройки.Вставить("МаксимальноеКоличествоОпросов", 300);

    Возврат Настройки;

КонецФункции

Функция ТипыОтветовOCR() Экспорт

    Типы = Новый Структура;

    Типы.Вставить("MistralOCR", 1);
    Типы.Вставить("PaddleOCR", 2);
    Типы.Вставить("AzureOCR", 3);
    Типы.Вставить("GoogleOCR", 4);
    Типы.Вставить("LocalOCR", 5);
    Типы.Вставить("Unknown", 0);

    Возврат Типы;

КонецФункции

Функция ТипыМоделейOCR() Экспорт

    Типы = Новый Структура;

    Типы.Вставить("MistralOCR", "mistral-ocr-latest");
    Типы.Вставить("Unknown", 0);

    Возврат Типы;

КонецФункции

Функция СтатусыРаспознавания() Экспорт

    Статусы = Новый Структура;
    Статусы.Вставить("Успешно", 1);
    Статусы.Вставить("Ошибка", 0);

    Возврат Статусы;

КонецФункции 

Функция ПрочитатьНастройки(Провайдер)
	
	СохраненныеНастройки = Новый Структура;
	
	Если ЗначениеЗаполнено(Провайдер) Тогда
		Отбор = Новый Структура("Провайдер", Провайдер);
		Выборка = РегистрыСведений.DR_НастройкиАдаптера.Выбрать(Отбор);
		Если Выборка.Следующий() Тогда
	        Запись = Выборка.ПолучитьМенеджерЗаписи();
		    Запись.Прочитать();
			СохраненныеНастройки.Вставить("АдресСервиса", Запись.АдресСервиса);
			СохраненныеНастройки.Вставить("АдресРесурса", Запись.АдресРесурса);
			СохраненныеНастройки.Вставить("Порт", Запись.Порт); 
			СохраненныеНастройки.Вставить("Таймаут", Запись.Таймаут);
			СохраненныеНастройки.Вставить("ApiKey", Запись.ApiKey); 
			СохраненныеНастройки.Вставить("Промпт", Запись.Промпт);
            Запись.Записать(Истина);
		КонецЕсли; 
	КонецЕсли;

	Возврат СохраненныеНастройки;
	
КонецФункции 

Функция ПолучитьПровайдерРаспознавания(Провайдер)
	
	Если НЕ ЗначениеЗаполнено(Провайдер) Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	
	ПровайдерСоответствие = Новый Соответствие;
	ПровайдерСоответствие.Вставить("MistralOCR", DR_MistralCloudProvider); 
	ПровайдерСоответствие.Вставить("PaddleOCR", DR_PaddleCloudProvider); 
	
	Возврат ПровайдерСоответствие.Получить(Провайдер);

КонецФункции
